{
    "darksoul": [
      {
        "id": "DS1",
        "heading": "Dark Souls I",
        "title" : "DSI",
        "characters" : [
          {
            "id" : "chosen",
            "name" : "The Chosen Undead",
            "lore" : "In ancient times, the world was under the rule of powerful dragons. They stood unopposed for a long time until the discovery of the first flame, which contained souls of great power. Four legendary figures harnessed these souls, three of which used this power to defeat the ancient dragons and ushered in the age of fire. The flame brought immense power and prosperity to kingdoms and armies. However, over time, the flame started to deplete, leaving only two choices - to let it fade away, marking the onset of the Age of Dark, or to extend the Age of Flame by sacrificing a chosen one's life. Now, it's your quest, and you have the power to make your own decision. Defeat those who hold the souls of the first flame and choose the path that aligns with your beliefs.",
            "images" : ["enter images"]
          },
          {
            "id" : "ornstein",
            "name" : "Dragon Slayer Ornstein",
            "lore" : "Dragon Slayer Ornstein was one of Lord Gwyn's most powerful and trusted knights, renowned for his skills with the great cross spear. He played a crucial role in the war against the ancient dragons, and even as Lord Gwyn made the ultimate sacrifice to extend the age of fire, Ornstein remained steadfast in his loyalty by standing guard at his Lord's kingdom in Anor Londo.",
            "images" : ["enter images"]
          }, 
          {
            "id" : "smough",
            "name" : "Executioner Smough",
            "lore" : "Smough was a powerful knight and executioner who had always dreamt of becoming one of Lord Gwyn's elite knights. Unfortunately, his grotesque pleasure in executing the kingdom's criminals led to his rejection. However, after Lord Gwyn's sacrifice, he was chosen to stand guard at Anor Londo, the kingdom of Lord Gwyn. Whether out of pity or pettiness, he now stands tall as a formidable defender of the kingdom.",
            "images" : ["enter images"]
          },
          {
            "id" : "nito",
            "name" : "Gravelord Nito",
            "lore" : "One of the four holders of the First Flame's lord souls was the formidable Nito, a creature of death and despair. With his mastery of dark arts and infection, Nito allied himself with Lord Gwyn and the Witch of Izalith to defeat the ancient dragons and establish their dominance. Following the war, Nito retreated back into the catacombs, where he first resided, and took on the task of administering death itself with his unparalleled power.",
            "images" : ["enter images"]
          },
          {
            "id" : "witch",
            "name" : "The Witch of Izalith",
            "lore" : "As one of the four holders of the First Flame's lord souls, the Witch of Izalith was a powerful shaman who wielded soul power to create formidable fire magic. Her underground civilization revolved around flame and she shared her knowledge and power among her seven daughters. She formed an alliance with Lord Gwyn and Nito to fight the ancient dragons, engulfing them in waves of flame and chaos to seize control of the surface. When the First Flame started to fade, the Witch and her daughters attempted to create their own, but unfortunately, they failed and instead created the Flame of Chaos, unleashing demons that transformed her daughters, her civilians, and herself into grotesque beings of flame.",
            "images" : ["enter images"]
          },
          {
            "id" : "seath",
            "name" : "Seath The Scaleless",
            "lore" : "Seath the Scaleless, true to his name, had no scales, which made him envious of his own kind. He chose to betray his fellow dragons in the ancient war and joined forces with the three figures of Flame, fighting alongside them. In return, Gwyn rewarded him with a shard of his lord soul and the construction of Seath's grand archive. Seath's relentless pursuit for immortality led him to madness as he plunged deeper into his research.",
            "images" : ["enter images"]
          },
          {
            "id" : "kings",
            "name" : "The Four Kings",
            "lore" : "The Four Kings were once mere leaders of human countries, but thanks to Gwyn, they were granted the prestigious titles of King. Gwyn rewarded them with a fragment of his lord soul and gave them the opportunity to construct their very own Kingdom, New Londo. However, after Gwyn’s ultimate sacrifice, the Four Kings turned towards the power of the dark and adapted their armies to do the same, becoming an immense threat to all the surrounding kingdoms.",
            "images" : ["enter images"]
          }, 
          {
            "id" : "knight",
            "name" : "Knight Artorias",
            "lore" : "Sir Artorias was an exceptionally skilled knight who earned the trust of Lord Gwyn. He fought alongside his lord in the ancient dragon war and proved his worth on the battlefield. After Lord Gwyn's selfless sacrifice, Artorias was entrusted with the daunting task of vanquishing the Abyss - a dark realm that threatened to engulf the world. Despite the dangers, Artorias accepted the challenge and was granted a special ring that enabled him to brave the horrors of the Abyss. He fought valiantly against the abyssal creatures, but his encounter with the monstrous Manus proved to be his undoing. Sadly, Artorias was overwhelmed by the corrupting influence of the Abyss, and his fate was sealed forever.",
            "images" : ["enter images"]
          },
          {
            "id" : "manus",
            "name" : "Manus, Father of the Abyss",
            "lore" : "Manus possessed immense soul power and was resurrected from death. He was buried with a pendant that held great value to him, but he later discovered that the royal family of the country he was buried in had stolen it. This made Manus furious, and he transformed into a terrifying beast, leading to the opening of an Abyss realm. Knight Artorias, in his mission to dispel darkness, fought Manus and succeeded in injuring him. However, this caused Artorias to become corrupt and ultimately led to his downfall.",
            "images" : ["enter images"]
          }, 
          {
            "id" : "gwyn",
            "name" : "Lord Gwyn",
            "lore" : "Lord Gwyn was one of the four powerful beings who held the lord souls. He played a vital role in the ancient dragon war and was allied with Nito and the Witch of Izalith. Together, they defeated the ancient dragons and dominated the surface world. However, as time passed, the First Flame began to fade, and Gwyn, fearing the darkness and the loss of his power, selflessly sacrificed himself to extend the flame's duration. He became a mere husk of himself, left to guard the First Flame for eternity.",
            "images" : ["enter images"]
          }
        ]
      },
      {
        "id": "DS2",
        "heading": "Dark Souls II",
        "title" : "DSII",
        "characters" : [
          {
            "id" : "bearer",
            "name" : "Bearer of the Curse",
            "lore" : "In a world set centuries after the first Age of Fire, you, an undead, are gradually becoming hollow due to a curse inflicted upon humans. As time passes, you fear losing your sense of self and growing insane. To avoid this fate, you decide to embark on a journey to Drangelic Castle, which is rumored to hold the cure to this condition. Driven by determination, you will do whatever it takes to find this cure and save yourself from a fate worse than death.",
            "images" : ["enter images"]
          }, 
          {
            "id" : "rotten",
            "name" : "The Rotten",
            "lore" : "The Rotten, once a respected king, is an abomination of merged hollows held together by flesh and chains. This monstrous creature possesses immense soul strength. In the past, he was known as King Gryth of Shulva who led the worship of an ancient dragon, Sinh, one of the last of its kind. His fame drew raiders who aimed to steal Sinh's rare blood, leading to Gryth's death. But, Gryth was not gone forever. He was resurrected as the Rotten, an amalgamation of dead hollows who gather their strength by merging with defeated foes.",
            "images" : ["enter images"]
          },
          {
            "id" : "sinner",
            "name" : "The Lost Sinner",
            "lore" : "The Lost Sinner is an undead who has been chained up for years, and her crimes have been lost to time. However, it is widely believed that she created a new generation of demons in an attempt to replicate the power of the First Flame. These demons went on to ravage the kingdom in which she resided. Overwhelmed with shame and guilt, the Lost Sinner chose to imprison and torture herself as punishment for her actions.",
            "images" : ["enter images"]
          },
          {
            "id" : "ironKing",
            "name" : "Old Iron King",
            "lore" : "The Old Iron King once ruled over a small kingdom of little value. However, he discovered a miraculous method of producing iron, which was so closely guarded that he died with it. Using this knowledge, he built a vast kingdom entirely made of iron and created iron demons known as Smelter Demons, using chaos flames to fight alongside his army. Over time, the king began to suffer from the curse, and eventually went mad. As his kingdom grew too heavy, it began to sink into the ground. Sensing weakness, the Smelter Demon that the iron king had constructed killed him and took over the sunken kingdom. In the presence of the chaos flame, the Old Iron King then resurrected as a horrid demon.",
            "images" : ["enter images"]
          },
          {
            "id" : "freyja",
            "name" : "The Duke's Dear Freyja",
            "lore" : "In the land where she resides, The Duke's Dear Freyja was once a pet spider of a duke. However, after becoming the host of an ancient entity called Writhing, formally an entity that took place in the ancient dragon Seath, she grew to an enormous size and gathered immense power over the years by gathering the souls of those she killed.",
            "images" : ["enter images"]
          },
          {
            "id" : "watcher",
            "name" : "Throne Watcher",
            "lore" : "The Throne Watcher is a mysterious figure about whom very little is known. However, it is widely believed that she and the Throne Defender were the ultimate tests of strength for anyone who wished to claim the Throne of Want. Unfortunately, King Vendrick was unable to complete this challenge, and as a result, the throne room was consumed by darkness, causing both the Watcher and Defender to succumb to the corrupting influence of the Abyss.",
            "images" : ["enter images"]
          },
          {
            "id" : "defender",
            "name" : "Throne Defender",
            "lore" : "The Throne Defender is an enigmatic figure who holds his ground in the throne room, where King Vendrick was supposed to sit. His long white beard and cryptic face suggest that he has been guarding the room for a prolonged period, and his identity and purpose remain a mystery. According to popular belief, the Throne Defender and the Throne Watcher serve as a challenge for those who aspire to claim the Throne of Want, testing the strength of their character and willpower.",
            "images" : ["enter images"]
          },
          {
            "id" : "nashandra",
            "name" : "Queen Nashandra",
            "lore" : "Hello",
            "images" : ["enter images"]
          },
          {
            "id" : "king",
            "name" : "King Vendrick",
            "lore" : "Hello",
            "images" : ["enter images"]
          },
          {
            "id" : "aldria",
            "name" : "Aldia, Scholar of the First Sin",
            "lore" : "Hello",
            "images" : ["enter images"]
          }
        ]
      },
      {
        "id": "DS3",
        "heading": "Dark Souls III",
        "title" : "DSIII",
        "characters" : [
          {
            "id" : "ashen",
            "name" : "The Ashen One",
            "lore" : "Hello",
            "images" : ["enter images"]
          },
          {
            "id" : "watchers",
            "name" : "The Abyss Watchers",
            "lore" : "Hello",
            "images" : ["enter images"]
          }, 
          {
            "id" : "yhorm",
            "name" : "Yhorm The Giant",
            "lore" : "Hello",
            "images" : ["enter images"]
          },
          {
            "id" : "aldritch",
            "name" : "Aldrich, Devourer of Gods",
            "lore" : "Hello",
            "images" : ["enter images"]
          },
          {
            "id" : "ludleth",
            "name" : "Ludleth the Exciled",
            "lore" : "Hello",
            "images" : ["enter images"]
          },
          {
            "id" : "lothric",
            "name" : "Lothric and Lorian",
            "lore" : "Hello",
            "images" : ["enter images"]
          },
          {
            "id" : "cinder",
            "name" : "Soul of Cinder",
            "lore" : "Hello",
            "images" : ["enter images"]
          },
          {
            "id" : "gael",
            "name" : "Slave Knight Gael",
            "lore" : "Hello",
            "images" : ["enter images"]
          },
          {
            "id" : "nameless",
            "name" : "The Nameless King",
            "lore" : "Hello",
            "images" : ["enter images"]
          },
          {
            "id" : "midir",
            "name" : "Darkeater Midir",
            "lore" : "Hello",
            "images" : ["enter images"]
          }
        ]
      }
     
    ]
    
  }



